<template>
  <ul>
    <li v-for="comment in article.comments" :key="comment.id">
      {{ comment.content }}
    </li>
  </ul>
</template>

<script setup lang="ts">
import { useRoute } from "vue-router";

const route = useRoute();
const articleId = route.params.id;

const articles = [
  {
    id: 1,
    title: "《三国演义》",
    content:
      "   《三国演义》是中国古典四大名著之一，由明代小说家罗贯中创作。这部小说以东汉末年到西晋初年之间的历史为背景，讲述了魏、蜀、吴三国之间的政治和军事斗争。小说塑造了一系列栩栩如生的人物形象，如曹操、刘备、孙权、诸葛亮、关羽、张飞等，以及许多脍炙人口的故事，如桃园三结义、赤壁之战、三顾茅庐等。《三国演义》不仅是一部历史小说，也蕴含了丰富的政治、军事、哲学和人生智慧。它以宏大的叙事结构、深刻的人物刻画和精彩的故事情节，展现了那个时代的社会风貌和人物性格，对后世的文学创作产生了深远的影响。",
    comments: [
      {
        id: 1,
        content:
          "《三国演义》被一些读者视为权力的游戏与人性的较量的展现。这部历史小说通过精彩的故事情节和人物形象，描绘了一个错综复杂的历史画卷。人民文学出版社1998年的版本，通过精心的校注，使得这部作品的文字更加精准，更便于现代读者的阅读和理解。小说从“宴桃园豪杰三结义”开始，展现了三国时期的英勇与智谋。",
      },
      {
        id: 2,
        content:
          "有读者在评论中提到，初读《三国演义》时，对各路英雄豪杰的斗智斗勇感到热血沸腾。随着故事的发展，群雄逐鹿的场面逐渐转变为魏蜀吴三国鼎立之势，最终导致蜀、吴两国渐呈颓势，魏国也走上了丞相集权的老路，直至司马昭篡位，天下再次归一。",
      },
      {
        id: 3,
        content:
          "另一条评论指出，《三国演义》中的一些情节，如刘安杀妻以飨刘备，显得十分突兀。评论者质疑，是否需要用一个女人的惨死来体现百姓对皇叔的尊敬，并对小说中的性别观念提出了批评。",
      },
      {
        id: 4,
        content:
          "还有读者在评论中分享了自己的读书心得，认为《三国演义》永远是对于具体文本的深耕。他们提到，从小一直听评书，不同的评书演员根据不同的宋代话本，讲的三国演义也各不相同，因此当阅读原著时有了不同的感受。",
      },
    ],
  },
  {
    id: 2,
    title: "《水浒传》",
    content:
      "《水浒传》是中国古典四大名著之一，由元末明初的文学家施耐庵所著，并由罗贯中加以润色及编排。这部小说以北宋末年宋江领导的梁山泊农民起义为题材，塑造了宋江、林冲、武松、鲁智深等108位英雄好汉的形象，他们因为各种原因被逼上梁山，形成了一股反抗封建统治的力量。《水浒传》的故事最初起源于北宋宣和年间，从南宋开始就成为了民间口头文学的主要题材。施耐庵把这些在不同地区流传的故事汇集起来，经过选择、加工、再创作，写成了《水浒传》。小说通过生动的情节和鲜明的人物形象，展现了当时社会的矛盾和冲突，以及人民群众反抗封建压迫的斗争精神。《水浒传》的结构是纵横交错的复式结构，梁山起义的发生发展和失败的全过程纵贯全篇，其间连缀着一个一个相对独立自成整体的主要人物的故事。这些故事自身在结构上既纵横开合，各尽特色，又是整个水浒故事的有机组成部分。小说的语言采用白话文，生动、形象，充满了生活气息，对后世的文学创作产生了深远的影响。《水浒传》的版本有繁本和简本之分。繁本通常指嘉靖年间的百回本，而简本则是在万历年间出现的，增加了征田虎、征王庆的故事。此外，还有金圣叹评的七十回本，这个版本对原著进行了删减，并加上了自己的评语。",
    comments: [
      {
        id: 1,
        content:
          "金圣叹曾评价《水浒传》说：“天下之文章，无有出《水浒传》右者。”他认为读书之乐，第一莫若读《水浒传》，不读《水浒传》，不知天下之奇。鲁迅也认为《水浒传》中的对话描写巧妙，能让读者通过对话看到人物形象，这一点在中国小说中非常突出。胡适更是认为《水浒》在中国文学史占的地位比《左传》《史记》还要重大得多。梁实秋则表示《水浒传》是第一部影响他的书，他一读再读，不忍释手。",
      },
      {
        id: 2,
        content:
          "有读者在豆瓣上评论《水浒传》时表示：“破碎的乌托邦，空梦一场，黑暗政治下的无奈。”他们认为《水浒传》中的人物高举“替天行道”的大旗，但最终他们心中的理想国却破碎了。这位读者对《水浒传》的理解和感受非常深刻，他们看到了小说背后的悲剧色彩和对黑暗政治的无奈。",
      },
      {
        id: 3,
        content:
          "另一位读者在评论中提到：“《水浒传》是中国古代小说中一部独特的作品，它展现了宋朝社会的黑暗与腐败，对人性和社会现象进行了深刻的思考。”他们认为《水浒传》不仅是一部描写农民起义的史诗，更是一幅深刻揭示封建社会矛盾的现实画卷。",
      },
      {
        id: 4,
        content:
          "还有读者在评论中写道：“《水浒传》的英雄们，他们性格各异，但都有着共同的信念——反抗不公，追求正义。”他们被《水浒传》中的英雄人物所吸引，认为这些人物虽然有着不同的背景和性格，但都为了反抗不公和追求正义而聚集在一起。这位读者对《水浒传》的理解和感受体现了他们对小说中人物和主题的深刻洞察。",
      },
    ],
  },
];
const article = articles.find((a) => a.id === Number(articleId));
</script>
